{"translation-revision-date":"2023-09-07 02:49+0100","generator":"WP-CLI\/2.10.0","source":"build\/slider\/index.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"pt_PT","plural-forms":"nplurals=2; plural=(n != 1);"},"Settings":["Configurações"],"Add slide":["Adicionar slide"],"Loop":["Ciclo"],"When enabled, the slider will behave as a carousel.":["Quando activado, o slider comportar-se-á como um carrossel."],"Rewind":["Rebobinar"],"When enabled, clicking the \"next\" navigation button on the last slide will take you back to the first slide. When you click the \"previous\" navigation button on the first slide, it will take you to the last slide.":["Quando activado, clicar no botão de navegação “seguinte” no último slide leva-o de volta ao primeiro slide. Se clicar no botão de navegação “anterior” no primeiro slide, regressará ao último slide."],"Autoplay":["Reprodução automática"],"Free Mode":["Modo livre"],"Navigation":["Navegação"],"Pagination":["Paginação"],"Hash Navigation":["Navegação por Hash"],"When enabled, you can load a page with a specific slide open. Each slide requires a \"URL Hash\", which can be set on each slide block.":["Quando activado, pode carregar uma página com um slide específico aberto. Cada slide requer um \"Hash de URL\", que pode ser definido em cada bloco de slide."],"Speed":["Velocidade"],"Duration of transition between slides (in milliseconds).":["Duração da transição entre slides (em milissegundos)."],"Width":["Largura"],"The slider will not be responsive if this parameter is set.":["O slider não será responsivo se este parâmetro estiver definido."],"Height":["Altura"],"Auto Height":["Altura automática"],"When enabled, the slider will adjust its height to match the height of the currently active slide.":["Quando activada, o slider ajustará a sua altura para corresponder à altura do slide actualmente activo."],"Per View":["Por visualização"],"Number of slides per view (slides visible at the same time).":["Número de slides por visualização (slides visíveis ao mesmo tempo)."],"Space Between Slides":["Espaço entre slides"],"The distance between slides.":["A distância entre os slides."],"Centered Slides":["Slides centrados"],"When enabled, the active slide will be centered.":["Quando activado, o slide activo será centrado."],"Delay":["Atraso"],"Delay between transitions (in milliseconds).":["Atraso entre transições (em milissegundos)."],"Pause on Hover":["Pausa ao passar o rato"],"When enabled autoplay will be paused on pointer (mouse) enter over the slider.":["Quando activada, a reprodução automática é interrompida quando o ponteiro (rato) passa sobre o slider."],"Type":["Tipo"],"Bullets":["Indicadores"],"Fraction":["Fracção"],"Progress Bar":["Barra de progresso"],"Accessibility":["Acessibilidade"],"Aria Label":["Aria Label"],"Sets an aria-label attribute to the root element.":["Define um atributo aria-label para o elemento raiz."]}}}